src/k-bench-results/k3s/reliability-worker/reliability-worker-5/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1311.35          ---          ---        13.86131        12.86300        28.03100        46.33500       101.02 
Gets        13112.00         4.67     13107.33        13.85374        12.86300        28.03100        46.59100       510.90 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14423.35         4.67     13107.33        13.85443        12.86300        28.03100        46.59100       611.92 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.655        0.000
SET      11.647        5.000
SET      12.095       10.000
SET      12.287       15.000
SET      12.351       20.000
SET      12.479       25.000
SET      12.543       30.000
SET      12.607       35.000
SET      12.671       40.000
SET      12.735       45.000
SET      12.863       50.000
SET      12.863       52.500
SET      12.927       55.000
SET      12.991       57.500
SET      13.055       60.000
SET      13.119       62.500
SET      13.183       65.000
SET      13.247       67.500
SET      13.375       70.000
SET      13.439       72.500
SET      13.567       75.000
SET      13.631       76.250
SET      13.695       77.500
SET      13.759       78.750
SET      13.823       80.000
SET      13.887       81.250
SET      14.015       82.500
SET      14.143       83.750
SET      14.271       85.000
SET      14.527       86.250
SET      14.911       87.500
SET      15.103       88.125
SET      15.359       88.750
SET      15.679       89.375
SET      15.999       90.000
SET      16.511       90.625
SET      17.151       91.250
SET      18.047       91.875
SET      19.711       92.500
SET      21.375       93.125
SET      23.039       93.750
SET      23.551       94.062
SET      23.935       94.375
SET      24.191       94.688
SET      24.447       95.000
SET      24.575       95.312
SET      24.831       95.625
SET      24.959       95.938
SET      25.087       96.250
SET      25.343       96.562
SET      25.471       96.875
SET      25.599       97.031
SET      25.599       97.188
SET      25.727       97.344
SET      25.855       97.500
SET      25.983       97.656
SET      26.111       97.812
SET      26.239       97.969
SET      26.495       98.125
SET      26.623       98.281
SET      26.879       98.438
SET      27.007       98.516
SET      27.135       98.594
SET      27.263       98.672
SET      27.391       98.750
SET      27.519       98.828
SET      27.775       98.906
SET      28.031       98.984
SET      28.287       99.062
SET      28.671       99.141
SET      29.311       99.219
SET      29.567       99.258
SET      29.951       99.297
SET      30.335       99.336
SET      30.975       99.375
SET      31.487       99.414
SET      32.127       99.453
SET      32.767       99.492
SET      33.535       99.531
SET      34.303       99.570
SET      35.327       99.609
SET      35.583       99.629
SET      36.351       99.648
SET      36.863       99.668
SET      37.375       99.688
SET      38.143       99.707
SET      38.655       99.727
SET      39.423       99.746
SET      39.935       99.766
SET      40.703       99.785
SET      41.471       99.805
SET      41.983       99.814
SET      42.495       99.824
SET      42.751       99.834
SET      43.263       99.844
SET      43.775       99.854
SET      44.287       99.863
SET      44.799       99.873
SET      45.311       99.883
SET      45.823       99.893
SET      46.591       99.902
SET      46.847       99.907
SET      47.359       99.912
SET      47.615       99.917
SET      47.871       99.922
SET      48.383       99.927
SET      49.151       99.932
SET      49.407       99.937
SET      49.919       99.941
SET      50.687       99.946
SET      51.199       99.951
SET      51.711       99.954
SET      51.711       99.956
SET      51.967       99.958
SET      52.479       99.961
SET      52.991       99.963
SET      53.503       99.966
SET      54.015       99.968
SET      54.527       99.971
SET      55.039       99.973
SET      55.551       99.976
SET      56.063       99.977
SET      56.319       99.978
SET      56.319       99.979
SET      56.575       99.980
SET      56.831       99.982
SET      57.343       99.983
SET      57.855       99.984
SET      58.367       99.985
SET      59.391       99.987
SET      59.647       99.988
SET      60.159       99.988
SET      60.415       99.989
SET      61.183       99.990
SET      61.695       99.990
SET      61.695       99.991
SET      61.951       99.991
SET      62.975       99.992
SET      63.999       99.993
SET      64.255       99.993
SET      64.511       99.994
SET      65.023       99.994
SET      65.279       99.995
SET      66.047       99.995
SET      66.047       99.995
SET      66.047       99.995
SET      66.559       99.996
SET      67.071       99.996
SET      67.583       99.996
SET      68.095       99.997
SET      69.631       99.997
SET      70.143       99.997
SET      70.655       99.997
SET      71.167       99.997
SET      71.167       99.998
SET      71.679       99.998
SET      73.215       99.998
SET      73.727       99.998
SET      73.727       99.998
SET      74.239       99.998
SET      74.239       99.998
SET      74.751       99.999
SET      75.775       99.999
SET      75.775       99.999
SET      76.287       99.999
SET      76.287       99.999
SET      76.287       99.999
SET      77.311       99.999
SET      77.311       99.999
SET      77.823       99.999
SET      77.823       99.999
SET      77.823       99.999
[...]
SET      78.335       99.999
SET      78.335       99.999
SET      78.335       99.999
SET      78.335      100.000
SET      78.335      100.000
SET      78.335      100.000
[...]
SET      79.871      100.000
SET      79.871      100.000
SET      79.871      100.000
[...]
SET      80.895      100.000
SET      80.895      100.000
SET      80.895      100.000
[...]
SET      98.303      100.000
SET      98.303      100.000
---
GET       1.319        0.000
GET      11.647        5.000
GET      12.095       10.000
GET      12.287       15.000
GET      12.351       20.000
GET      12.479       25.000
GET      12.543       30.000
GET      12.607       35.000
GET      12.671       40.000
GET      12.735       45.000
GET      12.863       50.000
GET      12.863       52.500
GET      12.927       55.000
GET      12.991       57.500
GET      13.055       60.000
GET      13.119       62.500
GET      13.183       65.000
GET      13.247       67.500
GET      13.375       70.000
GET      13.439       72.500
GET      13.567       75.000
GET      13.631       76.250
GET      13.631       77.500
GET      13.759       78.750
GET      13.823       80.000
GET      13.887       81.250
GET      14.015       82.500
GET      14.143       83.750
GET      14.271       85.000
GET      14.527       86.250
GET      14.847       87.500
GET      15.103       88.125
GET      15.359       88.750
GET      15.679       89.375
GET      15.999       90.000
GET      16.511       90.625
GET      17.023       91.250
GET      18.047       91.875
GET      19.583       92.500
GET      21.247       93.125
GET      22.911       93.750
GET      23.423       94.062
GET      23.807       94.375
GET      24.063       94.688
GET      24.319       95.000
GET      24.575       95.312
GET      24.703       95.625
GET      24.959       95.938
GET      25.087       96.250
GET      25.215       96.562
GET      25.471       96.875
GET      25.471       97.031
GET      25.599       97.188
GET      25.727       97.344
GET      25.855       97.500
GET      25.983       97.656
GET      26.111       97.812
GET      26.239       97.969
GET      26.367       98.125
GET      26.623       98.281
GET      26.879       98.438
GET      26.879       98.516
GET      27.007       98.594
GET      27.263       98.672
GET      27.391       98.750
GET      27.519       98.828
GET      27.775       98.906
GET      28.031       98.984
GET      28.287       99.062
GET      28.671       99.141
GET      29.311       99.219
GET      29.567       99.258
GET      29.951       99.297
GET      30.335       99.336
GET      30.847       99.375
GET      31.487       99.414
GET      32.127       99.453
GET      32.767       99.492
GET      33.535       99.531
GET      34.303       99.570
GET      35.327       99.609
GET      35.839       99.629
GET      36.351       99.648
GET      36.863       99.668
GET      37.375       99.688
GET      38.143       99.707
GET      38.655       99.727
GET      39.423       99.746
GET      40.191       99.766
GET      40.703       99.785
GET      41.471       99.805
GET      41.983       99.814
GET      42.495       99.824
GET      42.751       99.834
GET      43.263       99.844
GET      43.775       99.854
GET      44.287       99.863
GET      45.055       99.873
GET      45.567       99.883
GET      46.079       99.893
GET      46.847       99.902
GET      47.103       99.907
GET      47.615       99.912
GET      47.871       99.917
GET      48.383       99.922
GET      48.639       99.927
GET      49.151       99.932
GET      49.663       99.937
GET      50.175       99.941
GET      50.687       99.946
GET      51.199       99.951
GET      51.455       99.954
GET      51.967       99.956
GET      52.223       99.958
GET      52.735       99.961
GET      52.991       99.963
GET      53.503       99.966
GET      54.015       99.968
GET      54.527       99.971
GET      55.295       99.973
GET      55.807       99.976
GET      56.063       99.977
GET      56.319       99.978
GET      56.831       99.979
GET      57.343       99.980
GET      57.599       99.982
GET      58.111       99.983
GET      58.623       99.984
GET      59.135       99.985
GET      59.647       99.987
GET      60.159       99.988
GET      60.415       99.988
GET      60.671       99.989
GET      60.927       99.990
GET      61.183       99.990
GET      61.695       99.991
GET      62.207       99.991
GET      62.463       99.992
GET      62.975       99.993
GET      63.743       99.993
GET      64.255       99.994
GET      64.767       99.994
GET      65.023       99.995
GET      65.279       99.995
GET      66.047       99.995
GET      66.047       99.995
GET      66.559       99.996
GET      67.071       99.996
GET      67.583       99.996
GET      68.095       99.997
GET      68.607       99.997
GET      69.119       99.997
GET      69.119       99.997
GET      69.631       99.997
GET      70.143       99.998
GET      70.655       99.998
GET      71.167       99.998
GET      71.679       99.998
GET      72.191       99.998
GET      72.703       99.998
GET      73.727       99.998
GET      73.727       99.999
GET      74.239       99.999
GET      74.751       99.999
GET      75.263       99.999
GET      75.263       99.999
GET      75.775       99.999
GET      76.799       99.999
GET      77.311       99.999
GET      78.335       99.999
GET      79.359       99.999
GET      80.383       99.999
GET      80.895       99.999
GET      81.407       99.999
GET      81.407       99.999
GET      81.919       99.999
GET      82.431       99.999
GET      82.943      100.000
GET      82.943      100.000
GET      82.943      100.000
GET      83.455      100.000
GET      83.455      100.000
GET      83.455      100.000
GET      83.967      100.000
GET      83.967      100.000
GET      84.479      100.000
GET      84.479      100.000
GET      86.015      100.000
GET      89.599      100.000
GET      91.135      100.000
GET      91.647      100.000
GET      92.159      100.000
GET      92.159      100.000
GET      92.671      100.000
GET      92.671      100.000
GET      92.671      100.000
[...]
GET      93.183      100.000
GET      93.183      100.000
GET      96.767      100.000
GET      97.279      100.000
GET      97.279      100.000
GET      97.791      100.000
GET      97.791      100.000
GET      97.791      100.000
GET      98.815      100.000
GET      98.815      100.000
GET      99.327      100.000
GET      99.327      100.000
GET      99.327      100.000
GET      99.839      100.000
GET      99.839      100.000
GET      99.839      100.000
[...]
GET     100.351      100.000
GET     100.351      100.000
GET     100.351      100.000
[...]
GET     100.863      100.000
GET     100.863      100.000
GET     100.863      100.000
[...]
GET     101.375      100.000
GET     101.375      100.000
---
WAIT      0.000      100.000